Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/db-omegat.tmx
Source language: en_us
Languages: pt_br

source: Database product version
pt_br: Versão do produto do Banco de dados

source: The class {0} was not found.
pt_br: A classe {0} não foi localizada.

source: Add the relevant driver using the New Driver action on the Drivers node.
pt_br: Adicionar o driver relevante utilizando a ação de Novo Driver no nó dos Drivers.

source: Unable to connect to the database.
pt_br: Incapaz de conectar no banco de dados.

source: You probably entered an incorrect database URL, username, or password.
pt_br: Você provavelmente informou uma URL de banco de dados, usuário ou senha incorreta.

source: Unable to connect to the database because: {0}
pt_br: Incapaz de conectar no banco de dados: {0}

source: no usable column in place
pt_br: nenhuma coluna utilizável no local

source: unable to create node information for table
pt_br: Incapaz de criar nó de informação para tabela

source: unable to create node information for view
pt_br: Incapaz de criar nó de informação para visão

source: unable to open stream {0}
pt_br: Incapaz de abrir fluxo {0}

source: insufficient information to create a connection
pt_br: Informação insuficiente para criar a conexão

source: cannot establish a connection to {0} using {1} ({2})
pt_br: Não pode estabelecer uma conexão para {0} utilizando {1} ({2})

source: {0} Ensure the server is started at {1}.
pt_br: {0} Assegura que o servidor foi em {1}.

source: Use the Tools menu to start a local PointBase server, or the appropriate PointBase command to start a remote server.
pt_br: Utiliza o menu Ferramentas para iniciar um servidor PontoBase local, ou o comando PontoBase apropriado para iniciar um servidor remoto.

source: More about starting and shutting down the server can be found in the PointBase documentation.
pt_br: Mais a respeito de inicialização e paralização do servidor pode ser encontrado na documentação PontoBase.

source: cannot operate with {0}
pt_br: não pode operar com {0}

source: cannot find {0}
pt_br: não pode localizar {0}

source: cannot find as text {0}
pt_br: não pode localizar como texto {0}

source: unknown code {0}
pt_br: código desconhecido {0}

source: connection error; {0}
pt_br: erro de conexão; {0}

source: unable to find class information for {0}
pt_br: incapaz de localizar informação de classe para {0}

source: unable to create node information {0}
pt_br: incapaz de criar nó de informação {0}

source: unable to read information for {0}
pt_br: incapaz de ler informação para {0}

source: unable to create children, {0}
pt_br: incapaz de criar filho, {0}

source: driver {0} already exists in list
pt_br: driver {0} já existe na lista

source: driver {0} was not found
pt_br: driver {0} não foi localizado

source: unable to create node information for index
pt_br: incapaz de criar nó de informação para índice

source: unable to create node information for procedure
pt_br: incapaz de criar nó de informação para procedure

source: unable to create node information for procedure column
pt_br: incapaz de criar nó de informação para coluna de procedure

source: unable to create node information for exported key
pt_br: incapaz de criar nó de informação para chave exportada

source: connection already exists
pt_br: conexão já existe

source: index {0} already contains column {1}
pt_br: índice {0} já contém coluna {1}

source: cannot find index owner information
pt_br: não pode localizar informação do dono do índice

source: no specification factory
pt_br: nenhuma fábrica especificada

source: cannot find table owner information
pt_br: não pode localizar informação do dono da tabela

source: cannot find column owner information
pt_br: não pode localizar informação do dono da coluna

source: Unable to change the name, command {0} is not supported by the system
pt_br: Incapaz de alterar o nome, comando {0} não é suportado pelo sistema

source: Unable to install all components to the JDBC palette; {0} was not found.
pt_br: Incapaz de instalar todos os componentes para a paleta JDBC; {0} não foi localizado.

source: Add the relevant packages to your $IDE_HOME/lib/ext/ folder and restart the application.
pt_br: Adicione os pacotes relevantes para sua pasta $IDE_HOME/lib/ext/ e reinicie a aplicação.

source: Exception {0} during the creation of the Databases folder.
pt_br: Exceção {0} durante a criação da pasta dos Bancos de dados.

source: Unable to create table.
pt_br: Incapaz de criar tabela.

source: Unable to add column.
pt_br: Incapaz de adicionar coluna.

source: Unable to add driver.
pt_br: Incapaz de adicionar driver.

source: Unable to connect.
pt_br: Incapaz de conectar.

source: Unable to add connection.
pt_br: incapaz de adicionar conexão.

source: Unable to initialize connection.
pt_br: Incapaz de iniciar conexão

source: Unable to add index.
pt_br: Incapaz de adicionar índice.

source: Unable to create view.
pt_br: Incapaz de criar visão.

source: Unable to create stored procedure.
pt_br: Incapaz de criar stored procedure.

source: Unable to disconnect.
pt_br: Incapaz de disconectar.

source: Unable to grab catalog.
pt_br: Incapaz de capturar catálogo.

source: Unable to recreate catalog.
pt_br: Incapaz de recriar catálogo.

source: Unable to grab table.
pt_br: Incapaz de capturar tabela.

source: Unable to recreate table.
pt_br: Incapaz de recriar tabela.

source: Unable to remove column from primary key.
pt_br: Incapaz de remover coluna da chave primária.

source: Unable to delete column.
pt_br: Incapaz de excluir coluna.

source: {0} The exception which caused this error has been logged to the message log.
pt_br: {0} A exceção que causou o erro foi gravado no log de mensagem.

source: <No schema>
pt_br: <Nenhum esquema>

source: unable to locate localized menu item {0}
pt_br: incapaz de localizar item de menu traduzido {0}

source: Database Explorer
pt_br: Banco de Dados Explorer

source: UNKNOWN
pt_br: DESCONHECIDO

source: <untitled>
pt_br: <sem título>

source: Insufficient information to create a table.
pt_br: Informação insuficiente para criar a tabela.

source: Check the name of the table, the number of columns, and the column types.
pt_br: Verifique o nome da tabela, o numero de colunas e os tipos de coluna.

source: Insufficient information to add a column.
pt_br: Informação insuficiente para adicionar a coluna.

source: Check the column name and column type.
pt_br: Verifique o nome da coluna e o tipo da coluna.

source: This driver is used by another database connection; you have to disconnect it.
pt_br: O driver esta sendo utilizado por outra conexão de banco de dados, você deve se desconectar.

source: The PointBase JDBC driver is not able to hold more than one connection.
pt_br: O driver JDBC PontoBase não é capaz de manipular mais de uma conexão.

source: unable to create node information for foreign key
pt_br: incapaz de criar nó de informação para chave estrangeira

source: Specify type of index:
pt_br: Tipo específico de índice:

source: Basic setting
pt_br: Configuração básica

source: Advanced
pt_br: Avançado

source: Basic set of arguments to create database connection
pt_br: Conjunto básico de argumentos para criar uma conexão de banco de dados

source: Selection of database schema to use in the connection
pt_br: Seleção de esquema de banco de dados para utilizar na conexão

source: Connect
pt_br: Conectar

source: &User name:
pt_br: &Nome do usuário:

source: Database connect
pt_br: Conectar banco de dados

source: Database connect dialog
pt_br: Dialog de conexão ao banco

source: Product name.
pt_br: Nome do produto.

source: Product name combo box
pt_br: Caixa de seleção com o nome do produto

source: Combo box containing all product names.
pt_br: Caixa de seleção contendo todos os nomes de produto.

source: Connection progress bar
pt_br: Barra de progresso da conexão

source: Progress bar showing the progress of connecting to the database.
pt_br: Barra de progresso demostrando o progresso da conexão com o banco de dados.

source: &Select schema:
pt_br: &Selecione um esquema:

source: &Get Schemas
pt_br: &Busque Esquemas

source: Select a database schema to use.
pt_br: Selecione um esquema de banco de dados para utilizar.

source: There is no schema with same name as user name.
pt_br: Não há nenhum esquema com o mesmo nome do usuário.

source: You need to choose one of the schemas.
pt_br: Você precisa escolher um dos esquemas.

source: Unable to obtain schema.
pt_br: Incapaz de obter esquema.

source: There is insufficient information to establish a connection to obtain list of schemas.
pt_br: Informação insuficiente para estabelecer uma conexão para obter lista de esquemas.

source: Check database URL, user and password.
pt_br: Verifique a URL do banco de dados, usuário e senha.

source: Driver message: {0}
pt_br: Mensagem do driver: {0}

source: Schema combo box
pt_br: Combo box com esquema

source: Combo box containing all available schemas.
pt_br: Combo box contendo todas os esquemas disponíveis.

source: Schema panel description
pt_br: Descrição do painel de esquema

source: Select a database schema tab panel
pt_br: Selecione uma aba do painél com esquema de banco de dados

source: Tab panel enabling to select a database schema
pt_br: Aba do painél sendo habilitada para seleção do esquema de banco de dados

source: Get database schemas button
pt_br: Botão de busca de esquemas de banco de dados

source: Get available database schemas.
pt_br: Busca esquemas de banco de dados disponíveis.

source: Connecting to Database
pt_br: Conectando ao banco de dados

source: Connecting to database, please wait...
pt_br: Conectando ao banco de dados, aguarde ...

source: Connecting to database...
pt_br: Conectando ao banco de dados...

source: Retrieving the list of schemas...
pt_br: Retornando lista de esquemas...

source: Schema list retrieved.
pt_br: Lista de esquema retornada.

source: Connection established.
pt_br: Conexão estabelecida.

source: Connection failed.
pt_br: Conexão falhou.

source: Database
pt_br: Banco de Dados

source: Views and modifies the structure of the connected database.
pt_br: Visualiza e modifica a estrutura do banco de dados conectado.

source: Uses the Explorer to view the current structure of the connected database tables and their data while you are developing database applications or applets within the IDE.
pt_br: Utilizo o Explorer para visualizar a estrutura das tabelas do banco de dados contectado e seus dados enquanto você está desenvolvendo aplicações de banco de dados ou applets no IDE.

source: Database Explorer Module Help
pt_br: Ajuda do Módulo Banco de Dados Explorer

source: List of DatabaseMetaData Adaptors
pt_br: Lista dos Adaptadores DatabaseMetaData

source: Database Connection
pt_br: Conexão com Banco de Dados

source: List of Driver Templates
pt_br: Lista dos Modelos de Driver

source: Driver Template
pt_br: Modelo de Driver

source: Foreign Key
pt_br: Chave Estrangeira

source: Primary Key
pt_br: Chave Primária

source: List of Stored Procedures
pt_br: Lista das Stored Procedures

source: Stored Procedure Parameter
pt_br: Parâmetro da Stored Procedure

source: Database Explorer Module Home
pt_br: Home do Módulo Banco de Dados Explorer

source: List of Tables
pt_br: Lista de Tabelas

source: Table
pt_br: Tabela

source: List of Views
pt_br: Lista de Visões

source: View
pt_br: Visão

source: List of Foreign Keys
pt_br: Lista de Chaves Estrangeiras

source: List of Indexes
pt_br: Lista de Índices

source: Tables
pt_br: Tabelas

source: Views
pt_br: Visões

source: Foreign keys
pt_br: Chaves estrangeiras

source: Indexes
pt_br: Índices

source: Please wait...
pt_br: Por favor aguarde...

source: Copy Cell Value
pt_br: Copiar Valor de Célula

source: Copy Row Values
pt_br: Copiar Valores da Linha

source: Driver {0} is in use by connection {1}.
pt_br: Driver {0} está em uso pela conexão {1}.

source: Are you sure you want to delete it?
pt_br: Tem certeza que deseja excluir isto?

source: Some of these {0} drivers are in use by some connections Are you sure you want to delete them?
pt_br: Alguns destes drivers {0} estão em uso por algumas conexões Você tem certeza que deseja exclui-lás?

source: Confirm Object Deletion
pt_br: Confirmar Exclusão de Objeto

source: Confirm Multiple Object Deletion
pt_br: Confirmar Exclusão Múltipa de Objetos

source: Connected to Database
pt_br: Conectado ao Banco de Dados

source: Database APIs
pt_br: APIs do Banco de Dados

source: Database support APIs
pt_br: APIs de suporte ao Banco de Dados

source: Provides friend APIs related to the database support.
pt_br: Fornece APIs amigáveis relacionadas a suporte ao banco de dados.

source: Database Core
pt_br: Núcleo do Banco de Dados

source: Core database support.
pt_br: Suporte ao núcleo do banco de dados.

source: Contains core parts of the database support.
pt_br: Contém partes do núcleo do suporte ao banco de dados.

source: SQL Editor
pt_br: Editor SQL

source: SQL Editor Opened
pt_br: Editor SQL Aberto

source: Executing SQL statement(s)
pt_br: Executando comando(s) SQL

source: SQL statement(s) executed successfully.
pt_br: Comando(s) SQL executado(s) com sucesso.

source: SQL statement(s) execution finished with errors.
pt_br: Execução de comando(s) SQL finalizado com erros.

source: An error occurred while reading the result set.
pt_br: Ocorreu um erro durante leitura do result set.

source: An error occurred while reading the result set: {0}
pt_br: Ocorreu um erro durante leitura do result set: {0}

source: SQL Execution
pt_br: Execução SQL

source: An error occurred during execution: {0}
pt_br: Ocorreu um erro durante execução: {0}

source: {0} execution
pt_br: execução {0}

source: Executed successfully in {0} s, {1} rows affected.
pt_br: Executado com sucesso em {0} s, {1} linhas afetadas.

source: Executed successfully in {0} s.
pt_br: Executado com successo em {0} s.

source: Line {0}, column {1}
pt_br: Linha {0}, coluna {1}

source: Error code {0}, SQL state {1}: {2}
pt_br: Código do erro {0}, estado do SQL {1}: {2}

source: Execution finished after {0} s, {1} error(s) occurred.
pt_br: Execução finalizada após {0} s, {1} erro(s) encontrado.

source: Execution cancelled.
pt_br: Execução cancelada.

source: SQL Objects
pt_br: Objetos SQL

source: Executing {0}
pt_br: Executando {0}

source: &All
pt_br: &Todos

source: Fetch a next set
pt_br: Recuperar o próximo conjunto

source: Fetch all the records
pt_br: Recuperar todos os registros

source: Stop fetching records
pt_br: Parar recuperação de registros

source: Fetch Records
pt_br: Recuperar Registros

source: The SQL Editor just completed a fetch of {0} records.
pt_br: O Editor SQL completou a recuperação de {0} registros.

source: Clicking Yes will fetch the next {1} records.
pt_br: Clicando em Sim será recuperado os próximos {1} registros.

source: Copy the cell value to the clipboard
pt_br: Copiar o valor da célula para área de transferência

source: Copy the row values to the clipboard
pt_br: Copiar os valores da linha para área de transferência

source: Rows affected by the last statement: {0}.
pt_br: Linhas afetadas pelo último comando: {0}.

source: unknown
pt_br: desconhecido

source: Base IDE
pt_br: IDE Básico

source: Provides a visual and text SQL editor and a browser of database connections, tables and their data.
pt_br: Fornece um editor visual de texto SQL e um navegador de conexões de banco de dados, tabelas e seus dados.

source: Database browser, visual and text SQL editor.
pt_br: Navegador do Banco de dados, editor visual de texto SQL.

source: Query Editor
pt_br: Editor de Query

source: Provides support for query editor
pt_br: Fornece suporte para o editor de query

source: Data
pt_br: Dado

source: Data Source Drag and Drop Settings
pt_br: Configurações Drag and Drop da Fonte de Dados

source: Data Source Drag and Drop
pt_br: Drag and Drop da Fonte de Dados

source: Create RowSets in Session
pt_br: Criar RowSets em Sessão

source: Check for Duplicate RowSets
pt_br: Verificar por RowSets Duplicados

source: Suffix for Data Providers
pt_br: Sufixo para Provedores de Dados

source: Suffix for RowSets
pt_br: Sufixo para RowSets

source: SEVERE: Could not get logger -- using global logger
pt_br: SEVERO: Não pode recuperar o logger -- utilizando o logger global

source: Query Editor Opened
pt_br: Editor de Query Aberto

source: Select the Data Sources for export, then provide a file name.
pt_br: Selecione as Fontes de Dados para exportação, então informe um nome de arquivo.

source: File Name:
pt_br: Nome do Arquivo:

source: F
pt_br: A

source: File name for the Data Source definitions.
pt_br: Nome do Arquivo para as definições da Fonte de Dados.

source: Browse..
pt_br: Localizar..

source: B
pt_br: L

source: Use a File Chooser to Browse to the desired file
pt_br: Utilize Abrir Arquivo para Localizar o arquivo desejado

source: Export Data Sources
pt_br: Exportar Fontes de Dados

source: Export Data Source definitions to a File
pt_br: Exportar as definições da Fonte de Dados para um Arquivo

source: Data Sources
pt_br: Fontes de Dados

source: Select one or more Data Sources
pt_br: Selecione um ou mais Fontes de Dados

source: Error occurred while writing to file.
pt_br: Ocorreu um erro durante escrita em arquivo.

source: Check the validity of the file name.
pt_br: Verifique a validade do nome do arquivo.

source: Import Data Sources
pt_br: Importar Fontes de Dados

source: Import Data Sources Definitions from a File
pt_br: Importar Definições das Fontes de Dados de um Arquivo

source: Select the Data Sources to Import
pt_br: Selecione os Fontes de Dados para Importar

source: Error occurred while importing datasources
pt_br: Ocorreu erro durante importação de fonte de dados

source: Error occurred while reading from file {0}.
pt_br: Ocorreu um erro durante leitura em arquivo {0}.

source: Check the validity of the file.
pt_br: Verifique a validade do arquivo.

source: Error: {1}
pt_br: Erro: {1}

source: File does not exist.
pt_br: O arquivo não existe.

source: Error occurred while parsing the file.
pt_br: Ocorreu um erro durante análise em arquivo.

source: Loading Data Sources.
pt_br: Carregando Fontes de Dados

source: Please wait ..
pt_br: Por favor aguarde ..

source: File not specified.
pt_br: Arquivo não informado.

source: Select All
pt_br: Selecionar Todos

source: Select All Data Sources
pt_br: Selecionar Todas as Fontes de Dados

source: Clear
pt_br: Limpar

source: Clear All Data Source Selections
pt_br: Limpar Todas as Seleções de Fonte de Dados

source: Include
pt_br: Incluir

source: Include the User ID in the exported file
pt_br: Incluir o ID do Usuário no arquivo exportado

source: Include the User's password in the exported file
pt_br: Incluir a senha do Usuário no arquivo exportado

source: Data Sources successfully exported to file
pt_br: Fontes de Dados exportado para arquivo com sucesso

source: Data Sources successfully imported from file
pt_br: Fontes de Dados importado para arquivo com sucesso

source: List of Server Types to be used when creating Data Sources.
pt_br: Lista de Tipos de Servidor para serem usados na criação de Fonte de Dados.

source: New...
pt_br: Novo...

source: Create a New Database Server Type
pt_br: Criar um Novo Tipo de Servidor de Banco de Dados

source: Delete
pt_br: Excluir

source: Delete the selected Server Type
pt_br: Excluir o Tipo de Servidor selecionado

source: Display Name:
pt_br: Nome de Exibição:

source: The Name to Display in the Add Datasource Dialog
pt_br: O Nome para ser Exibido na Janela para Inclusão de Fonte de Dados

source: Driver Class Name:
pt_br: Nome da Classe do Driver:

source: The Driver's fully qualified Class Name
pt_br: O Nome de Classe totalmente qualificado do Driver

source: URL Template:
pt_br: Modelo de URL:

source: The URL template.
pt_br: O modelo de URL:

source: Use #HOSTNAME and #DATABASE for substitution when adding a datasource.
pt_br: Utilize #HOSTNAME e #DATABASE para substituição ao adicionar uma fonte de dados

source: Example: jdbc:sun:oracle://#HOSTNAME:1521;SID=#DATABASE
pt_br: Exemplo: jdbc:sun:oracle://#HOSTNAME:1521;SID=#DATABASE

source: Example:
pt_br: Exemplo:

source: JDBC Driver Jar File(s):
pt_br: Arquivo(s) Jar de Driver JDBC:

source: JDBC jar files required for this Driver
pt_br: Arquivos jar JDBC obrigatórios para este Driver

source: Add...
pt_br: Adicionar...

source: Add a Jar file to the list
pt_br: Adicionar um arquivo Jar para a lista

source: Remove
pt_br: Remover

source: Remove the selected Jar File from the list
pt_br: Remover o Arquivo Jar selecionado da lista

source: Server Types
pt_br: Tipos de Servidor

source: Edit Database Server Types
pt_br: Editar Tipos de Servidor de Banco de Dados

source: Provide a display name for the JDBC driver
pt_br: Forneça o nome de exibição para o driver JDBC

source: File {0} already added.
pt_br: Arquivo {0} já foi adicionado.

source: Error occurred while copying file.
pt_br: Ocorreu um erro durante cópia de arquivo.

source: Please check file permissions of
pt_br: Por favor verifique as permissões do arquivo

source: does not exist.
pt_br: não existe.

source: Corresponding driver jar file(s) will not be deleted.
pt_br: Arquivo(s) jar do driver correspondente não será excluído.

source: Continue anyway?
pt_br: Continuar mesmo assim?

source: Delete driver jar
pt_br: Excluir jar do driver

source: Error deleting
pt_br: Erro na exclusão

source: Add a Data Source Definition
pt_br: Adicionar uma Definição de Fonte de Dados

source: Modify a Data Source Definition
pt_br: Modificar a Definição de Fonte de Dados

source: Data Source Name:
pt_br: Nome da Fonte de Dados:

source: Data Source Name
pt_br: Nome da Fonte de Dados

source: Server Type:
pt_br: Tipo de Servidor:

source: The Server Type describes a database server type and it's driver class
pt_br: O Tipo de Servidor descreve um tipo de servidor de banco de dados e suas classes de driver

source: Database Name:
pt_br: Nome do Banco de Dados:

source: The database name to use within this data source's URL.
pt_br: O nome do banco de dados para utilizar com a URL da fonte de dados.

source: Host Name:
pt_br: Nome do Host:

source: The host name or IP address to use within this data source's URL.
pt_br: O nome do host ou endereço IP para utilizar com a URL da fonte de dados.

source: User ID:
pt_br: ID do Usuário:

source: The database user name is used to log into the database server.
pt_br: O nome de usuário do banco de dados é utilizado para autenticação no servidor de banco de dados.

source: Password:
pt_br: Senha:

source: The database user name's password.
pt_br: A senha do usuário do banco de dados.

source: Database URL:
pt_br: URL do Banco de Dados:

source: The URL used by jdbc to connect to the database.
pt_br: A URL usada pelo jdbc para conexão ao banco de dados.

source: Driver Class:
pt_br: Classe do Driver:

source: The java class name for the database driver.
pt_br: O nome da classe java para o driver do banco de dados.

source: This is a function of your Server Type.
pt_br: Esta é uma função para seu Tipo de Servidor.

source: Edit...
pt_br: Editar...

source: Edit the list of Server Types
pt_br: Editar a lista dos Tipos de Servidor

source: Test Connection
pt_br: Testar Conexão

source: Test the connection to the database.
pt_br: Testar a conexão no banco de dados.

source: Validation Table:
pt_br: Validação na Tabela:

source: Table to be used by the application server for validating it's database connection.
pt_br: Tabela que será usada pelo servidor de aplicação para validação da conexão do banco de dados.

source: Add
pt_br: Adicionar

source: Browse...
pt_br: Localizar......

source: Cancel
pt_br: Cancelar

source: Add Data Source
pt_br: Adicionar Fonte de Dados

source: Data Source
pt_br: Fonte de Dados

source: Database Type:
pt_br: Tipo de Banco de Dados:

source: Edit ...
pt_br: Editar...

source: Help
pt_br: Ajuda
